export const dummyTrips = [
  {
    _id: "white-desert-premium",
    slug: "white-desert-premium",
    title: "برنامج رحلة الصحراء البيضاء",
    location: "واحة الفرافرة، الوادي الجديد",
    duration: "3 أيام / ليلتين",
    image: "/trip-desert.jpg", 
    
    // أسعار وخصومات
    price: 6499,
    originalPrice: 9800,
    discountCode: "Frafra",
    discountAmount: "3300 جنيه",

    gathering: [
      { 
        icon: "📍", 
        text: "التجمع الأول: 10:30 مساءً – باب مكتب حجز جو باص – عبد المنعم رياض" 
      },
      { 
        icon: "🚐", 
        text: "التحرك: 11:00 مساءً مع استراحة بالطريق" 
      },
      { 
        icon: "⛽", 
        text: "التجمع الثاني: 11:40 مساءً – بنزينة شيل أوت الجديدة (آخر سور حدائق الأهرام – بوابة منقرع البوابة الثالثة حدائق الأهرام )" 
      },
    ],

    itinerary: [
      {
        day: "اليوم الأول – الجمعة",
        activities: [
          { icon: "🕳️", text: "زيارة كهف الجارة والغابة الجيولوجية المتحجرة" },
          { icon: "🍳", text: "الوصول لكامب Uzersaif في واحة الفرافرة + إفطار مصري أصيل" },
          { icon: "🚙", text: "بدء مغامرة السفاري سيارات 4×4" },
          { icon: "⛰️", text: "وادي العقبات وكهف القمر" },
          { icon: "🏂", text: "تجربة التزلج على الرمال Sandboarding" },
          { icon: "🥗", text: "غداء خفيف في عين خضرا" },
          { icon: "🌑", text: "زيارة منطقة سطح القمر" },
          { icon: "🗿", text: "جولة التكوينات (المشروم، الفرخة، الأرنب، الحصان، الجمل، أبو الهول)" },
          { icon: "🔥", text: "عشاء باربكيو بالتتبيلة البدوية + سهرة نجوم وشاي زردا" },
        ],
      },
      {
        day: "اليوم الثاني – السبت",
        activities: [
          { icon: "🌅", text: "شروق الشمس + إفطار بدوي في قلب الصحراء" },
          { icon: "🏨", text: "دخول الفندق البدوي وراحة لمدة 3 ساعات" },
          { icon: "🍽️", text: "غداء خفيف في كامب UzerSaif" },
          { icon: "🏛️", text: "قصر الفرافرة وبيت أمينة (تراث واحة الفرافرة)" },
          { icon: "🌿", text: "جناين الواحة والعيون الرومانية (بداية الحياة في الواحة)" },
          { icon: "🎨", text: "متحف بدر عبد المغني (متحف عالمي)" },
          { icon: "🎶", text: "حفلة سمر بدوية (ليه تاكسي اللي جاي من الحمام عليه خميسة من قدام ؟)" },
          { icon: "🍛", text: "عشاء ماندي بالتتبيلة البدوية السرية" },
        ],
      },
      {
        day: "اليوم الثالث – الأحد",
        activities: [
          { icon: "💎", text: "زيارة جبل الكريستال (أغلى جبل في مصر)" },
          { icon: "🌋", text: "زيارة الصحراء السوداء والجبال البركانية" },
          { icon: "🛍️", text: "السوق ( لشراء منتجات الواحة )" },
          { icon: "🏠", text: "العودة إلى القاهرة حوالي الساعة 10:00 مساءً" },
        ],
      },
    ],

    // قسم ضمان بدو واحة الفرافرة
    guarantees: [
      {
        title: "في الأكل",
        items: ["اكل طازة organic &  Healthy ، وتقدر تطلب اكتر", "مياه معدنية ، ومشروبات ساخنة وشاي زردا طول اليوم"],
      },
      {
        title: "في النوم",
        items: ["التخييم في مكان بعيد عن الحشرات او الزواحف.", "سليبنج باج تستحمل اقصي البرد و بطانية إضافية ."],
      },
      {
        title: "في الإلغاء",
        items: ["استرجاع كامل المبلغ في خلال 7 أيام", "تأكيد الإلغاء في 10 دقائق فقط"],
      },
      {
        title: "في الأمان",
        items: ["لا توجد أي مصاريف إضافية مخفية", "وجود مرشد بدوي جنبك طول الرحلة "],
      },
    ],

    bookingSteps: {
      deposit: "25%",
      method: "Vodafone Cash أو InstaPay",
      number: "01011879549",
      accountName: "ساهر عابد عمر سيد",
      requiredDocs: [ "موعد الرحلة", "صورة البطاقة الشخصية" , " سكرين شوت للتحويل "],
    }
  },
];